
import pandas as pd

data = [
        ["서울시나라개발시", "아파트 순회 소독", "(월급) 160만원", "신입", "서울 강남구", "24.09.30", "24.11.29"],
        ["서울시(주)한성", "방화동 아파트 경비직", "(시급) 9,860원", "신입", "서울 강서구", "24.09.30", "24.11.29"],
        ["서울시청", "아파트 순회 조경소독", "(월급) 175만원", "신입", "서울 강남구", "24.09.30", "24.11.29"],
        ["서울시(주)주식회사", "아파트 경비원 모집 [상계주공]", "(시급) 9,860원", "무관", "서울 노원구", "24.09.27", "24.11.26"],
        ["서울시미소로아이", "[송파동] 강남힘찬병원 미화원", "(월급) 215만원", "무관", "서울 송파구", "24.09.27", "24.11.26"],
        ["서울시(주)진성", "월계동 꿈의숲SK뷰아파트 미화", "(월급) 135만원", "무관", "서울 노원구", "24.09.27", "24.11.26"],
        ["서됨시나라개발시", "서빙고역 인근아파트 청소 미화", "(월급) 130만원", "신입", "서울 용산구", "24.09.27", "24.11.26"],
        ["서울시(주)대교", "대교산업 더케이호텔서울 미화원", "(월급) 207만원", "무관", "서울 서초구", "24.09.26", "24.11.25"],
        ["서울시남산트라팰", "중구 남산트라팰리스 청소 미화", "(월급) 180만원", "1년", "서울 중구", "24.09.26", "24.11.25"],
        ["서울시(주)두원", "여의도 롯데캐슬엠파이어 미화원", "(시급) 9,860원", "무관", "서울 영등포구", "24.09.26", "24.11.25"]
    ]

def save_csv(data):
    # CSV 파일의 열 이름 정의
    columns = ["회사명", "업종", "급여", "경력", "근무지", "등록일", "마감일"]

    # DataFrame 생성
    df = pd.DataFrame(data, columns=columns)

    # DataFrame을 CSV 파일로 저장
    df.to_csv('recruit.csv', index=False, encoding='utf-8-sig')  # 한글 깨짐 방지를 위해 utf-8-sig로 인코딩

    print("DataFrame 내용:\n", df)  # DataFrame 내용 출력
    return df

if __name__ == "__main__":
    save_csv(data)
    print("csv 파일이 성공적으로 저장됨")